[
"Why do the French like to eat snails so much? They can't stand fast food.",
"A guest calls the waiter and complains, \"How come there are no chairs at our table?!\" The waiter shrugs, \"I'm sorry but you only booked one table.\"",
"I asked my daughter if she'd seen my newspaper. She told me that newspapers are old school. She said that people use tablets nowadays and handed me her iPad. The fly didn't stand a chance.",
"I've been really depressed lately. A friend told me I should go to the petting zoo to cheer up. I went today, but not one person would pet me.",
"I forgot my cell phone when I went to the bathroom yesterday. We have 245 tiles.",
"How many gorillas can fit into a car? Eight. How many chickens can fit into the car? None, the car is already full of gorillas.",
"She: \"I have a doctor's appointment today but I really don't want to go.\" He: \"Just call in sick then.\"",
"I've always thought my neighbors were quite nice people. But then they put a password on their Wi-Fi.",
"A man goes to the lawyer: \"What is your fee?\" Lawyer says: \"1000 US dollars for 3 questions.\" Man: \"Wow - so much! Isn't it a bit expensive?\" Lawyer: \"Yes, what is your third question?\"",
"What did the judge ask when he went to the dentist? \"Do you swear to pull the tooth, the whole tooth and nothing but the tooth?\"",
"\"Mom, don't get alarmed, but I'm at the hospital.\" \"Son, I keep telling you. You've been a surgeon there for 8 years now. Can we please start our phone calls a little differently?\"",
"How did the barber win the race? He took a short cut.",
"Two clairvoyants meet. One says to the other: \"You are fine, and how am I?\"",
"What did one wall say to the other wall? We'll meet at the corner.",
"Teacher: \"OK class, who will give me the chemical formula for water?\" Pupil: \"HIJKLMNO.\" Teacher: \"What on earth are you on about?\" Pupil: \"Well you said yourself yesterday it was H to O!\"",
"\"I love your dog, what's its name?\" \"I don't know. He won't tell me.\"",
"\"Two days ago, my friend Peter ran off with my wife.\" \"Oh no, how long have you been friends?\" \"Since two days ago.\""
]